In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('employee_data.csv')
df

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [3]:
# head(n): Returns the first n rows of the DataFrame
# By default, it returns the first 5 rows
df.head()

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000

In [4]:
# tail(n): Returns the last n rows of the DataFrame
# By default, it returns the last 5 rows
df.tail()

   ID    Name  Age Department  Salary
5   6   Frank   29    Finance   50000
6   7   Grace   41         HR   82000
7   8  Hannah   26  Marketing   47000
8   9     Ian   35         IT   75000
9  10   Julia   30    Finance   60000

In [5]:
# sample(n): Returns n random rows from the DataFrame
# By default, it returns 1 random row
df.sample()

   ID Name  Age Department  Salary
4   5  Eva   38         IT   65000

In [6]:
# info(): Displays a concise summary of the DataFrame
# Includes column names, number of non-null values, and data types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10 non-null     int64
 1   Name        10 non-null     object
 2   Age         10 non-null     int64
 3   Department  10 non-null     object
 4   Salary      10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes

In [7]:
# describe(): Generates descriptive statistics for numerical columns
# Includes count, mean, standard deviation, min, max, and quartiles
df.describe()

             ID        Age        Salary
count  10.00000  10.000000     10.000000
mean    5.50000  32.900000  64500.000000
std     3.02765   6.674162  15182.226451
min     1.00000  25.000000  47000.000000
25%     3.25000  28.250000  51250.000000
50%     5.50000  31.000000  62500.000000
75%     7.75000  37.250000  74250.000000
max    10.00000  45.000000  91000.000000

In [8]:
# dtypes: Returns the data type of each column
df.dtypes

ID             int64
Name          object
Age            int64
Department    object
Salary         int64
dtype: object

In [9]:
# shape: Returns the dimensions of the DataFrame
# Format: (number of rows, number of columns)
df.shape

(10, 5)

In [10]:
# columns: Returns an index object containing column names
df.columns

Index(['ID', 'Name', 'Age', 'Department', 'Salary'], dtype='object')

In [11]:
# nunique(): Returns the number of unique values in each column
df.nunique()

ID            10
Name          10
Age           10
Department     4
Salary        10
dtype: int64